In [264]:
#importing libraries
import pandas as pd
import sqlite3
import numpy as np
import datetime

In [265]:
conn1 = sqlite3.connect("db.sqlite3")

In [266]:
DataAdd = pd.read_csv("../Users.csv")
DataAdd.head()

   foreign_id  username
0           1  fgVo76Mo
1           2  tMkhisT5
2           3  NfdgQcnt
3           4  venbVB4p
4           5  rs3BfROl

In [267]:
DataAdd.rename(columns = {'foreign_id':'id'},inplace=True)
DataAdd.head()

   id  username
0   1  fgVo76Mo
1   2  tMkhisT5
2   3  NfdgQcnt
3   4  venbVB4p
4   5  rs3BfROl

In [268]:
DataAdd["password"] = "pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$MzMjfm3Y7TfTrYqwvDiQlR85mWYXgxTXv/f6VryS6Es="
DataAdd["is_active"] = "1"
DataAdd["is_staff"] = "0"
DataAdd["is_superuser"] = "0"
DataAdd["first_name"] = "Hai"
DataAdd["last_name"] = "Nguyen"
DataAdd["date_joined"] = str(datetime.datetime.now())
DataAdd.drop(columns = "id",inplace = True)
DataAdd.head()
DataAdd.head()

,username,password,is_active,is_staff,is_superuser,first_name,last_name,date_joined
0,fgVo76Mo,pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$Mz...,1,0,0,Hai,Nguyen,2023-04-05 01:52:47.894190
1,tMkhisT5,pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$Mz...,1,0,0,Hai,Nguyen,2023-04-05 01:52:47.894190
2,NfdgQcnt,pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$Mz...,1,0,0,Hai,Nguyen,2023-04-05 01:52:47.894190
3,venbVB4p,pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$Mz...,1,0,0,Hai,Nguyen,2023-04-05 01:52:47.894190
4,rs3BfROl,pbkdf2_sha256$390000$0cPpAdrcdSrakYRxFdbzvn$Mz...,1,0,0,Hai,Nguyen,2023-04-05 01:52:47.894190

In [269]:
DataAdd = DataAdd.to_records(index=False)
DataAdd = list(DataAdd)

In [270]:
cursor = conn1.cursor()
sqlite_insert_with_param = """INSERT INTO users_customuser
                          (username, password, is_active, is_staff, is_superuser, first_name, last_name, date_joined) 
                          VALUES (?, ?, ?, ?, ?, ?, ?, ?);"""
cursor.executemany(sqlite_insert_with_param, DataAdd)
conn1.commit()
print("Total", cursor.rowcount, "Records inserted successfully into SqliteDb_developers table")
conn1.commit()
cursor.close()

Total 278858 Records inserted successfully into SqliteDb_developers table

# Book

In [271]:
import re

In [272]:
conn1 = sqlite3.connect("db.sqlite3")

In [273]:
DataAdd = pd.read_csv("../Books.csv")
DataAdd.head()

C:\Users\mamto\AppData\Local\Temp\ipykernel_18832\1826252766.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  DataAdd = pd.read_csv("../Books.csv")

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [274]:
DataAdd['book_slug']=  DataAdd['Book-Title'].map(lambda value: re.sub('\W+','',value))
#DataAdd["id"] = range(1, len(DataAdd)+1)

In [275]:
hairbd = pd.read_csv('BX-Book-Ratings-Subset.csv',sep=';')
hairbd.rename(columns={'Book-Rating':'total_rating'},inplace=True)
hairbd.head()

   User-ID        ISBN  total_rating
0   276747  0060517794             9
1   276747  0679776818             8
2   276788  0345443683             8
3   276788  043935806X             7
4   276822  0060096195            10

In [276]:
hairbd = hairbd.groupby("ISBN",as_index=False).mean()
print(hairbd.shape)
hairbd.drop(columns='User-ID',inplace=True)

display(NewRatingGroup.head())

(2178, 3)

         ISBN total_rating
0  0000913154         Null
1  0001010565         Null
2  0001046438         Null
3  0001046713         Null
4  000104687X         Null

In [277]:
hairbd = hairbd.drop_duplicates(subset="ISBN")
print(hairbd.shape)

(2178, 2)

In [278]:
HaibdJoin = DataAdd.merge(hairbd,on=['ISBN'],how='left')
HaibdJoin = HaibdJoin.drop_duplicates(subset="ISBN")
HaibdJoin.head()
print(len(HaibdJoin))

271360

In [279]:
HaibdJoin.fillna('Null', inplace=True)

In [280]:
HaibdJoin.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 271360 entries, 0 to 271359
Data columns (total 10 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271360 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271360 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271360 non-null  object
 8   book_slug            271360 non-null  object
 9   total_rating         271360 non-null  object
dtypes: object(10)
memory usage: 22.8+ MB

In [281]:
HaibdJoin = HaibdJoin.to_records(index=False)
HaibdJoin = list(HaibdJoin)

In [282]:
len(HaibdJoin)

271360

In [283]:
for i in range(4):
    print(HaibdJoin[i])

('0195153448', 'Classical Mythology', 'Mark P. O. Morford', 2002, 'Oxford University Press', 'http://images.amazon.com/images/P/0195153448.01.THUMBZZZ.jpg', 'http://images.amazon.com/images/P/0195153448.01.MZZZZZZZ.jpg', 'http://images.amazon.com/images/P/0195153448.01.LZZZZZZZ.jpg', 'ClassicalMythology', 'Null')
('0002005018', 'Clara Callan', 'Richard Bruce Wright', 2001, 'HarperFlamingo Canada', 'http://images.amazon.com/images/P/0002005018.01.THUMBZZZ.jpg', 'http://images.amazon.com/images/P/0002005018.01.MZZZZZZZ.jpg', 'http://images.amazon.com/images/P/0002005018.01.LZZZZZZZ.jpg', 'ClaraCallan', 'Null')
('0060973129', 'Decision in Normandy', "Carlo D'Este", 1991, 'HarperPerennial', 'http://images.amazon.com/images/P/0060973129.01.THUMBZZZ.jpg', 'http://images.amazon.com/images/P/0060973129.01.MZZZZZZZ.jpg', 'http://images.amazon.com/images/P/0060973129.01.LZZZZZZZ.jpg', 'DecisioninNormandy', 'Null')
('0374157065', 'Flu: The Story of the Great Influenza Pandemic of 1918 and the Search for the Virus That Caused It', 'Gina Bari Kolata', 1999, 'Farrar Straus Giroux', 'http://images.amazon.com/images/P/0374157065.01.THUMBZZZ.jpg', 'http://images.amazon.com/images/P/0374157065.01.MZZZZZZZ.jpg', 'http://images.amazon.com/images/P/0374157065.01.LZZZZZZZ.jpg', 'FluTheStoryoftheGreatInfluenzaPandemicof1918andtheSearchfortheVirusThatCausedIt', 'Null')

In [284]:
cursor = conn1.cursor()
sqlite_insert_with_param = """INSERT INTO main_app_books 
                            (ISBN, title, author, year_of_publication, publisher, img_s, img_m, img_l, book_slug, total_rating) 
                            VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"""
cursor.executemany(sqlite_insert_with_param, HaibdJoin)
conn1.commit()
print("Total", cursor.rowcount, "Records inserted successfully into SqliteDb_developers table")
conn1.commit()
cursor.close()

Total 271360 Records inserted successfully into SqliteDb_developers table

In [285]:
#print(HaibdJoin[0])
# TestPharse = ('006008667X', 'Lily Dale : The True Story of the Town that Talks to the Dead', 'Christine Wicker', 2004, 'HarperSanFrancisco', 'http://images.amazon.com/images/P/006008667X.01.THUMBZZZ.jpg', 'http://images.amazon.com/images/P/006008667X.01.MZZZZZZZ.jpg', 'http://images.amazon.com/images/P/006008667X.01.LZZZZZZZ.jpg', 'NULL', '')
# cursor = conn1.cursor()
# sqlite_insert_with_param = """INSERT INTO main_app_books (ISBN, title, author, year_of_publication, publisher, img_s, img_m, img_l, book_slug, total_rating)   VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"""
# cursor.execute(sqlite_insert_with_param, TestPharse)
# conn1.commit()
# print("Total", cursor.rowcount, "Records inserted successfully into SqliteDb_developers table")
# conn1.commit()
# cursor.close()

IntegrityError: UNIQUE constraint failed: main_app_books.ISBN

In [286]:
conn1.close()

# rating

In [297]:
conn1 = sqlite3.connect("db.sqlite3")

In [300]:
DataAdd = pd.read_csv("BX-Book-Ratings.csv",sep=';',encoding='latin-1')
print(len(DataAdd))
DataAdd = DataAdd.astype(str)
print(DataAdd.info())
DataAdd.head()

1149780
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  object
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  object
dtypes: object(3)
memory usage: 26.3+ MB
None

  User-ID        ISBN Book-Rating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

In [301]:
DataAdd = DataAdd.to_records(index=False)
DataAdd = list(DataAdd)
for i in range(4):
    print(DataAdd[i])

('276725', '034545104X', '0')
('276726', '0155061224', '5')
('276727', '0446520802', '0')
('276729', '052165615X', '3')

In [304]:
cursor = conn1.cursor()
sqlite_insert_with_param = """INSERT INTO main_app_ratings
                            (user_id, ISBN, rating) 
                            VALUES (?, ?, ?);"""
cursor.executemany(sqlite_insert_with_param, DataAdd)
conn1.commit()
print("Total", cursor.rowcount, "Records inserted successfully into SqliteDb_developers table")
conn1.commit()
cursor.close()

Total 1149780 Records inserted successfully into SqliteDb_developers table

In [303]:
# cursor = conn1.cursor()
# sqlite_insert_with_param = """DELETE FROM main_app_ratings"""
# cursor.execute(sqlite_insert_with_param)
# conn1.commit()
# print("Total", cursor.rowcount, "Records inserted successfully into SqliteDb_developers table")
# conn1.commit()
# cursor.close()

Total 1149780 Records inserted successfully into SqliteDb_developers table

In [305]:
conn1.close()